MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6010A/mcu.h
#define _IPC8_OC8IP_POSITION                     0x0000000C
#define _IPC8_OC8IP_MASK                         0x00007000
#define _IPC8_OC8IP_LENGTH                       0x00000003

#define _IPC8_OC5IP0_POSITION                    0x00000000
#define _IPC8_OC5IP0_MASK                        0x00000001
#define _IPC8_OC5IP0_LENGTH                      0x00000001

#define _IPC8_OC5IP1_POSITION                    0x00000001
#define _IPC8_OC5IP1_MASK                        0x00000002
#define _IPC8_OC5IP1_LENGTH                      0x00000001

#define _IPC8_OC5IP2_POSITION                    0x00000002
#define _IPC8_OC5IP2_MASK                        0x00000004
#define _IPC8_OC5IP2_LENGTH                      0x00000001

#define _IPC8_OC6IP0_POSITION                    0x00000004
#define _IPC8_OC6IP0_MASK                        0x00000010
#define _IPC8_OC6IP0_LENGTH                      0x00000001

#define _IPC8_OC6IP1_POSITION                    0x00000005
#define _IPC8_OC6IP1_MASK                        0x00000020
#define _IPC8_OC6IP1_LENGTH                      0x00000001

#define _IPC8_OC6IP2_POSITION                    0x00000006
#define _IPC8_OC6IP2_MASK                        0x00000040
#define _IPC8_OC6IP2_LENGTH                      0x00000001

#define _IPC8_OC7IP0_POSITION                    0x00000008
#define _IPC8_OC7IP0_MASK                        0x00000100
#define _IPC8_OC7IP0_LENGTH                      0x00000001

#define _IPC8_OC7IP1_POSITION                    0x00000009
#define _IPC8_OC7IP1_MASK                        0x00000200
#define _IPC8_OC7IP1_LENGTH                      0x00000001

#define _IPC8_OC7IP2_POSITION                    0x0000000A
#define _IPC8_OC7IP2_MASK                        0x00000400
#define _IPC8_OC7IP2_LENGTH                      0x00000001

#define _IPC8_OC8IP0_POSITION                    0x0000000C
#define _IPC8_OC8IP0_MASK                        0x00001000
#define _IPC8_OC8IP0_LENGTH                      0x00000001

#define _IPC8_OC8IP1_POSITION                    0x0000000D
#define _IPC8_OC8IP1_MASK                        0x00002000
#define _IPC8_OC8IP1_LENGTH                      0x00000001

#define _IPC8_OC8IP2_POSITION                    0x0000000E
#define _IPC8_OC8IP2_MASK                        0x00004000
#define _IPC8_OC8IP2_LENGTH                      0x00000001

#define _IPC9_INT3IP_POSITION                    0x00000000
#define _IPC9_INT3IP_MASK                        0x00000007
#define _IPC9_INT3IP_LENGTH                      0x00000003

#define _IPC9_INT4IP_POSITION                    0x00000004
#define _IPC9_INT4IP_MASK                        0x00000070
#define _IPC9_INT4IP_LENGTH                      0x00000003

#define _IPC9_C2IP_POSITION                      0x00000008
#define _IPC9_C2IP_MASK                          0x00000700
#define _IPC9_C2IP_LENGTH                        0x00000003

#define _IPC9_PWMIP_POSITION                     0x0000000C
#define _IPC9_PWMIP_MASK                         0x00007000
#define _IPC9_PWMIP_LENGTH                       0x00000003

#define _IPC9_INT3IP0_POSITION                   0x00000000
#define _IPC9_INT3IP0_MASK                       0x00000001
#define _IPC9_INT3IP0_LENGTH                     0x00000001

#define _IPC9_INT3IP1_POSITION                   0x00000001
#define _IPC9_INT3IP1_MASK                       0x00000002
#define _IPC9_INT3IP1_LENGTH                     0x00000001

#define _IPC9_INT3IP2_POSITION                   0x00000002
#define _IPC9_INT3IP2_MASK                       0x00000004
#define _IPC9_INT3IP2_LENGTH                     0x00000001

#define _IPC9_INT4IP0_POSITION                   0x00000004
#define _IPC9_INT4IP0_MASK                       0x00000010
#define _IPC9_INT4IP0_LENGTH                     0x00000001

#define _IPC9_INT4IP1_POSITION                   0x00000005
#define _IPC9_INT4IP1_MASK                       0x00000020
#define _IPC9_INT4IP1_LENGTH                     0x00000001

#define _IPC9_INT4IP2_POSITION                   0x00000006
#define _IPC9_INT4IP2_MASK                       0x00000040
#define _IPC9_INT4IP2_LENGTH                     0x00000001

#define _IPC9_C2IP0_POSITION                     0x00000008
#define _IPC9_C2IP0_MASK                         0x00000100
#define _IPC9_C2IP0_LENGTH                       0x00000001

#define _IPC9_C2IP1_POSITION                     0x00000009
#define _IPC9_C2IP1_MASK                         0x00000200
#define _IPC9_C2IP1_LENGTH                       0x00000001

#define _IPC9_C2IP2_POSITION                     0x0000000A
#define _IPC9_C2IP2_MASK                         0x00000400
#define _IPC9_C2IP2_LENGTH                       0x00000001

#define _IPC9_PWMIP0_POSITION                    0x0000000C
#define _IPC9_PWMIP0_MASK                        0x00001000
#define _IPC9_PWMIP0_LENGTH                      0x00000001

#define _IPC9_PWMIP1_POSITION                    0x0000000D
#define _IPC9_PWMIP1_MASK                        0x00002000
#define _IPC9_PWMIP1_LENGTH                      0x00000001

#define _IPC9_PWMIP2_POSITION                    0x0000000E
#define _IPC9_PWMIP2_MASK                        0x00004000
#define _IPC9_PWMIP2_LENGTH                      0x00000001

#define _IPC10_QEIIP_POSITION                    0x00000000
#define _IPC10_QEIIP_MASK                        0x00000007
#define _IPC10_QEIIP_LENGTH                      0x00000003

#define _IPC10_FLTAIP_POSITION                   0x0000000C
#define _IPC10_FLTAIP_MASK                       0x00007000
#define _IPC10_FLTAIP_LENGTH                     0x00000003

#define _IPC10_QEIIP0_POSITION                   0x00000000
#define _IPC10_QEIIP0_MASK                       0x00000001
#define _IPC10_QEIIP0_LENGTH                     0x00000001

#define _IPC10_QEIIP1_POSITION                   0x00000001
#define _IPC10_QEIIP1_MASK                       0x00000002
#define _IPC10_QEIIP1_LENGTH                     0x00000001

#define _IPC10_QEIIP2_POSITION                   0x00000002
#define _IPC10_QEIIP2_MASK                       0x00000004
#define _IPC10_QEIIP2_LENGTH                     0x00000001

#define _IPC10_FLTAIP0_POSITION                  0x0000000C
#define _IPC10_FLTAIP0_MASK                      0x00001000
#define _IPC10_FLTAIP0_LENGTH                    0x00000001

#define _IPC10_FLTAIP1_POSITION                  0x0000000D
#define _IPC10_FLTAIP1_MASK                      0x00002000
#define _IPC10_FLTAIP1_LENGTH                    0x00000001

#define _IPC10_FLTAIP2_POSITION                  0x0000000E
#define _IPC10_FLTAIP2_MASK                      0x00004000
#define _IPC10_FLTAIP2_LENGTH                    0x00000001

#define _IPC11_FLTBIP_POSITION                   0x00000000
#define _IPC11_FLTBIP_MASK                       0x00000007
#define _IPC11_FLTBIP_LENGTH                     0x00000003

#define _IPC11_FLTBIP0_POSITION                  0x00000000
#define _IPC11_FLTBIP0_MASK                      0x00000001
#define _IPC11_FLTBIP0_LENGTH                    0x00000001

#define _IPC11_FLTBIP1_POSITION                  0x00000001
#define _IPC11_FLTBIP1_MASK                      0x00000002
#define _IPC11_FLTBIP1_LENGTH                    0x00000001

