MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6010A/mcu.h
#define _C2RX0CON_JTOFF_POSITION                 0x00000001
#define _C2RX0CON_JTOFF_MASK                     0x00000002
#define _C2RX0CON_JTOFF_LENGTH                   0x00000001

#define _C2RX0CON_DBEN_POSITION                  0x00000002
#define _C2RX0CON_DBEN_MASK                      0x00000004
#define _C2RX0CON_DBEN_LENGTH                    0x00000001

#define _C2RX0CON_RXRTRRO_POSITION               0x00000003
#define _C2RX0CON_RXRTRRO_MASK                   0x00000008
#define _C2RX0CON_RXRTRRO_LENGTH                 0x00000001

#define _C2RX0CON_RXFUL_POSITION                 0x00000007
#define _C2RX0CON_RXFUL_MASK                     0x00000080
#define _C2RX0CON_RXFUL_LENGTH                   0x00000001

#define _C2RX0CON_FILHIT_POSITION                0x00000000
#define _C2RX0CON_FILHIT_MASK                    0x00000001
#define _C2RX0CON_FILHIT_LENGTH                  0x00000001

#define _C2RX0CON_RXB0DBEN_POSITION              0x00000002
#define _C2RX0CON_RXB0DBEN_MASK                  0x00000004
#define _C2RX0CON_RXB0DBEN_LENGTH                0x00000001

#define _C2CTRL_ICODE_POSITION                   0x00000001
#define _C2CTRL_ICODE_MASK                       0x0000000E
#define _C2CTRL_ICODE_LENGTH                     0x00000003

#define _C2CTRL_OPMODE_POSITION                  0x00000005
#define _C2CTRL_OPMODE_MASK                      0x000000E0
#define _C2CTRL_OPMODE_LENGTH                    0x00000003

#define _C2CTRL_REQOP_POSITION                   0x00000008
#define _C2CTRL_REQOP_MASK                       0x00000700
#define _C2CTRL_REQOP_LENGTH                     0x00000003

#define _C2CTRL_CANCKS_POSITION                  0x0000000B
#define _C2CTRL_CANCKS_MASK                      0x00000800
#define _C2CTRL_CANCKS_LENGTH                    0x00000001

#define _C2CTRL_ABAT_POSITION                    0x0000000C
#define _C2CTRL_ABAT_MASK                        0x00001000
#define _C2CTRL_ABAT_LENGTH                      0x00000001

#define _C2CTRL_CANSIDL_POSITION                 0x0000000D
#define _C2CTRL_CANSIDL_MASK                     0x00002000
#define _C2CTRL_CANSIDL_LENGTH                   0x00000001

#define _C2CTRL_CANFRZ_POSITION                  0x0000000E
#define _C2CTRL_CANFRZ_MASK                      0x00004000
#define _C2CTRL_CANFRZ_LENGTH                    0x00000001

#define _C2CTRL_CANCAP_POSITION                  0x0000000F
#define _C2CTRL_CANCAP_MASK                      0x00008000
#define _C2CTRL_CANCAP_LENGTH                    0x00000001

#define _C2CTRL_ICODE0_POSITION                  0x00000001
#define _C2CTRL_ICODE0_MASK                      0x00000002
#define _C2CTRL_ICODE0_LENGTH                    0x00000001

#define _C2CTRL_ICODE1_POSITION                  0x00000002
#define _C2CTRL_ICODE1_MASK                      0x00000004
#define _C2CTRL_ICODE1_LENGTH                    0x00000001

#define _C2CTRL_ICODE2_POSITION                  0x00000003
#define _C2CTRL_ICODE2_MASK                      0x00000008
#define _C2CTRL_ICODE2_LENGTH                    0x00000001

#define _C2CTRL_OPMODE0_POSITION                 0x00000005
#define _C2CTRL_OPMODE0_MASK                     0x00000020
#define _C2CTRL_OPMODE0_LENGTH                   0x00000001

#define _C2CTRL_OPMODE1_POSITION                 0x00000006
#define _C2CTRL_OPMODE1_MASK                     0x00000040
#define _C2CTRL_OPMODE1_LENGTH                   0x00000001

#define _C2CTRL_OPMODE2_POSITION                 0x00000007
#define _C2CTRL_OPMODE2_MASK                     0x00000080
#define _C2CTRL_OPMODE2_LENGTH                   0x00000001

#define _C2CTRL_REQOP0_POSITION                  0x00000008
#define _C2CTRL_REQOP0_MASK                      0x00000100
#define _C2CTRL_REQOP0_LENGTH                    0x00000001

#define _C2CTRL_REQOP1_POSITION                  0x00000009
#define _C2CTRL_REQOP1_MASK                      0x00000200
#define _C2CTRL_REQOP1_LENGTH                    0x00000001

#define _C2CTRL_REQOP2_POSITION                  0x0000000A
#define _C2CTRL_REQOP2_MASK                      0x00000400
#define _C2CTRL_REQOP2_LENGTH                    0x00000001

#define _C2CTRL_CSIDL_POSITION                   0x0000000D
#define _C2CTRL_CSIDL_MASK                       0x00002000
#define _C2CTRL_CSIDL_LENGTH                     0x00000001

#define _C2CFG1_BRP_POSITION                     0x00000000
#define _C2CFG1_BRP_MASK                         0x0000003F
#define _C2CFG1_BRP_LENGTH                       0x00000006

#define _C2CFG1_SJW_POSITION                     0x00000006
#define _C2CFG1_SJW_MASK                         0x000000C0
#define _C2CFG1_SJW_LENGTH                       0x00000002

#define _C2CFG1_BRP0_POSITION                    0x00000000
#define _C2CFG1_BRP0_MASK                        0x00000001
#define _C2CFG1_BRP0_LENGTH                      0x00000001

#define _C2CFG1_BRP1_POSITION                    0x00000001
#define _C2CFG1_BRP1_MASK                        0x00000002
#define _C2CFG1_BRP1_LENGTH                      0x00000001

#define _C2CFG1_BRP2_POSITION                    0x00000002
#define _C2CFG1_BRP2_MASK                        0x00000004
#define _C2CFG1_BRP2_LENGTH                      0x00000001

#define _C2CFG1_BRP3_POSITION                    0x00000003
#define _C2CFG1_BRP3_MASK                        0x00000008
#define _C2CFG1_BRP3_LENGTH                      0x00000001

#define _C2CFG1_BRP4_POSITION                    0x00000004
#define _C2CFG1_BRP4_MASK                        0x00000010
#define _C2CFG1_BRP4_LENGTH                      0x00000001

#define _C2CFG1_BRP5_POSITION                    0x00000005
#define _C2CFG1_BRP5_MASK                        0x00000020
#define _C2CFG1_BRP5_LENGTH                      0x00000001

#define _C2CFG1_SJW0_POSITION                    0x00000006
#define _C2CFG1_SJW0_MASK                        0x00000040
#define _C2CFG1_SJW0_LENGTH                      0x00000001

#define _C2CFG1_SJW1_POSITION                    0x00000007
#define _C2CFG1_SJW1_MASK                        0x00000080
#define _C2CFG1_SJW1_LENGTH                      0x00000001

#define _C2CFG2_PRSEG_POSITION                   0x00000000
#define _C2CFG2_PRSEG_MASK                       0x00000007
#define _C2CFG2_PRSEG_LENGTH                     0x00000003

#define _C2CFG2_SEG1PH_POSITION                  0x00000003
#define _C2CFG2_SEG1PH_MASK                      0x00000038
#define _C2CFG2_SEG1PH_LENGTH                    0x00000003

#define _C2CFG2_SAM_POSITION                     0x00000006
#define _C2CFG2_SAM_MASK                         0x00000040
#define _C2CFG2_SAM_LENGTH                       0x00000001

#define _C2CFG2_SEG2PHTS_POSITION                0x00000007
#define _C2CFG2_SEG2PHTS_MASK                    0x00000080
#define _C2CFG2_SEG2PHTS_LENGTH                  0x00000001

#define _C2CFG2_SEG2PH_POSITION                  0x00000008
#define _C2CFG2_SEG2PH_MASK                      0x00000700
#define _C2CFG2_SEG2PH_LENGTH                    0x00000003

#define _C2CFG2_WAKFIL_POSITION                  0x0000000E
#define _C2CFG2_WAKFIL_MASK                      0x00004000
#define _C2CFG2_WAKFIL_LENGTH                    0x00000001

