MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6010A/mcu.h
#define _C2INTF_TXEP_POSITION                    0x0000000C
#define _C2INTF_TXEP_MASK                        0x00001000
#define _C2INTF_TXEP_LENGTH                      0x00000001

#define _C2INTF_RX1OVR_POSITION                  0x0000000E
#define _C2INTF_RX1OVR_MASK                      0x00004000
#define _C2INTF_RX1OVR_LENGTH                    0x00000001

#define _C2INTF_RX0OVR_POSITION                  0x0000000F
#define _C2INTF_RX0OVR_MASK                      0x00008000
#define _C2INTF_RX0OVR_LENGTH                    0x00000001

#define _C2INTE_RXB0IE_POSITION                  0x00000000
#define _C2INTE_RXB0IE_MASK                      0x00000001
#define _C2INTE_RXB0IE_LENGTH                    0x00000001

#define _C2INTE_RXB1IE_POSITION                  0x00000001
#define _C2INTE_RXB1IE_MASK                      0x00000002
#define _C2INTE_RXB1IE_LENGTH                    0x00000001

#define _C2INTE_TXB0IE_POSITION                  0x00000002
#define _C2INTE_TXB0IE_MASK                      0x00000004
#define _C2INTE_TXB0IE_LENGTH                    0x00000001

#define _C2INTE_TXB1IE_POSITION                  0x00000003
#define _C2INTE_TXB1IE_MASK                      0x00000008
#define _C2INTE_TXB1IE_LENGTH                    0x00000001

#define _C2INTE_TXB2IE_POSITION                  0x00000004
#define _C2INTE_TXB2IE_MASK                      0x00000010
#define _C2INTE_TXB2IE_LENGTH                    0x00000001

#define _C2INTE_ERRIE_POSITION                   0x00000005
#define _C2INTE_ERRIE_MASK                       0x00000020
#define _C2INTE_ERRIE_LENGTH                     0x00000001

#define _C2INTE_WAKIE_POSITION                   0x00000006
#define _C2INTE_WAKIE_MASK                       0x00000040
#define _C2INTE_WAKIE_LENGTH                     0x00000001

#define _C2INTE_IRXIE_POSITION                   0x00000007
#define _C2INTE_IRXIE_MASK                       0x00000080
#define _C2INTE_IRXIE_LENGTH                     0x00000001

#define _C2INTE_RX0IE_POSITION                   0x00000000
#define _C2INTE_RX0IE_MASK                       0x00000001
#define _C2INTE_RX0IE_LENGTH                     0x00000001

#define _C2INTE_RX1IE_POSITION                   0x00000001
#define _C2INTE_RX1IE_MASK                       0x00000002
#define _C2INTE_RX1IE_LENGTH                     0x00000001

#define _C2INTE_TX0IE_POSITION                   0x00000002
#define _C2INTE_TX0IE_MASK                       0x00000004
#define _C2INTE_TX0IE_LENGTH                     0x00000001

#define _C2INTE_TX1IE_POSITION                   0x00000003
#define _C2INTE_TX1IE_MASK                       0x00000008
#define _C2INTE_TX1IE_LENGTH                     0x00000001

#define _C2INTE_TX2IE_POSITION                   0x00000004
#define _C2INTE_TX2IE_MASK                       0x00000010
#define _C2INTE_TX2IE_LENGTH                     0x00000001

#define _C2INTE_IVRIE_POSITION                   0x00000007
#define _C2INTE_IVRIE_MASK                       0x00000080
#define _C2INTE_IVRIE_LENGTH                     0x00000001

#define _C2EC_REC0_POSITION                      0x00000000
#define _C2EC_REC0_MASK                          0x00000001
#define _C2EC_REC0_LENGTH                        0x00000001

#define _C2EC_REC1_POSITION                      0x00000001
#define _C2EC_REC1_MASK                          0x00000002
#define _C2EC_REC1_LENGTH                        0x00000001

#define _C2EC_REC2_POSITION                      0x00000002
#define _C2EC_REC2_MASK                          0x00000004
#define _C2EC_REC2_LENGTH                        0x00000001

#define _C2EC_REC3_POSITION                      0x00000003
#define _C2EC_REC3_MASK                          0x00000008
#define _C2EC_REC3_LENGTH                        0x00000001

#define _C2EC_REC4_POSITION                      0x00000004
#define _C2EC_REC4_MASK                          0x00000010
#define _C2EC_REC4_LENGTH                        0x00000001

#define _C2EC_REC5_POSITION                      0x00000005
#define _C2EC_REC5_MASK                          0x00000020
#define _C2EC_REC5_LENGTH                        0x00000001

#define _C2EC_REC6_POSITION                      0x00000006
#define _C2EC_REC6_MASK                          0x00000040
#define _C2EC_REC6_LENGTH                        0x00000001

#define _C2EC_REC7_POSITION                      0x00000007
#define _C2EC_REC7_MASK                          0x00000080
#define _C2EC_REC7_LENGTH                        0x00000001

#define _C2EC_TEC0_POSITION                      0x00000008
#define _C2EC_TEC0_MASK                          0x00000100
#define _C2EC_TEC0_LENGTH                        0x00000001

#define _C2EC_TEC1_POSITION                      0x00000009
#define _C2EC_TEC1_MASK                          0x00000200
#define _C2EC_TEC1_LENGTH                        0x00000001

#define _C2EC_TEC2_POSITION                      0x0000000A
#define _C2EC_TEC2_MASK                          0x00000400
#define _C2EC_TEC2_LENGTH                        0x00000001

#define _C2EC_TEC3_POSITION                      0x0000000B
#define _C2EC_TEC3_MASK                          0x00000800
#define _C2EC_TEC3_LENGTH                        0x00000001

#define _C2EC_TEC4_POSITION                      0x0000000C
#define _C2EC_TEC4_MASK                          0x00001000
#define _C2EC_TEC4_LENGTH                        0x00000001

#define _C2EC_TEC5_POSITION                      0x0000000D
#define _C2EC_TEC5_MASK                          0x00002000
#define _C2EC_TEC5_LENGTH                        0x00000001

#define _C2EC_TEC6_POSITION                      0x0000000E
#define _C2EC_TEC6_MASK                          0x00004000
#define _C2EC_TEC6_LENGTH                        0x00000001

#define _C2EC_TEC7_POSITION                      0x0000000F
#define _C2EC_TEC7_MASK                          0x00008000
#define _C2EC_TEC7_LENGTH                        0x00000001

#define _RCON_POR_POSITION                       0x00000000
#define _RCON_POR_MASK                           0x00000001
#define _RCON_POR_LENGTH                         0x00000001

