MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6010A/mcu.h
#define CSW_FSCM_ON          0x071F
#define CSW_ON_FSCM_OFF      0x471F
#define CSW_FSCM_OFF         0x871F

/* Register FWDT (0xf80002)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FWDT;
#define _FWDT(x) __attribute__((address(0xf80002),deprecated_definition("consider migrating to #pragma config"),section("__FWDT.sec"),space(prog))) __prog__ uint16_t _FWDT = (x);

/*
** Only one invocation of FWDT should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FWDT.
** Multiple options may be combined, as shown:
**
** _FWDT( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   WDT Prescaler B:
**     WDTPSB_1             1:1
**     WDTPSB_2             1:2
**     WDTPSB_3             1:3
**     WDTPSB_4             1:4
**     WDTPSB_5             1:5
**     WDTPSB_6             1:6
**     WDTPSB_7             1:7
**     WDTPSB_8             1:8
**     WDTPSB_9             1:9
**     WDTPSB_10            1:10
**     WDTPSB_11            1:11
**     WDTPSB_12            1:12
**     WDTPSB_13            1:13
**     WDTPSB_14            1:14
**     WDTPSB_15            1:15
**     WDTPSB_16            1:16
**
**   WDT Prescaler A:
**     WDTPSA_1             1:1
**     WDTPSA_8             1:8
**     WDTPSA_64            1:64
**     WDTPSA_512           1:512
**
**   Watchdog Timer:
**     WDT_OFF              Disabled
**     WDT_ON               Enabled
**
*/

#define WDTPSB_1             0x8030
#define WDTPSB_2             0x8031
#define WDTPSB_3             0x8032
#define WDTPSB_4             0x8033
#define WDTPSB_5             0x8034
#define WDTPSB_6             0x8035
#define WDTPSB_7             0x8036
#define WDTPSB_8             0x8037
#define WDTPSB_9             0x8038
#define WDTPSB_10            0x8039
#define WDTPSB_11            0x803A
#define WDTPSB_12            0x803B
#define WDTPSB_13            0x803C
#define WDTPSB_14            0x803D
#define WDTPSB_15            0x803E
#define WDTPSB_16            0x803F

#define WDTPSA_1             0x800F
#define WDTPSA_8             0x801F
#define WDTPSA_64            0x802F
#define WDTPSA_512           0x803F

#define WDT_OFF              0x003F
#define WDT_ON               0x803F

/* Register FBORPOR (0xf80004)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FBORPOR;
#define _FBORPOR(x) __attribute__((address(0xf80004),deprecated_definition("consider migrating to #pragma config"),section("__FBORPOR.sec"),space(prog))) __prog__ uint16_t _FBORPOR = (x);

/*
** Only one invocation of FBORPOR should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBORPOR.
** Multiple options may be combined, as shown:
**
** _FBORPOR( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   POR Timer Value:
**     PWRT_OFF             Timer Disabled
**     PWRT_4               4ms
**     PWRT_16              16ms
**     PWRT_64              64ms
**
**   Brown Out Voltage:
**     BORV45               4.5V
**     BORV42               4.2V
**     BORV27               2.7V
**     BORV20               Reserved
**
**   PBOR Enable:
**     PBOR_OFF             Disabled
**     PBOR_ON              Enabled
**
**   Low-side PWM Output Polarity:
**     PWMxL_ACT_LO         Active Low
**     PWMxL_ACT_HI         Active High
**
**   High-side PWM Output Polarity:
**     PWMxH_ACT_LO         Active Low
**     PWMxH_ACT_HI         Active High
**
**   PWM Output Pin Reset:
**     RST_PWMPIN           Control with HPOL/LPOL bits
**     RST_IOPIN            Control with PORT/TRIS regs
**
**   Master Clear Enable:
**     MCLR_DIS             Disabled
**     MCLR_EN              Enabled
**
*/

#define PWRT_OFF             0x87B0
#define PWRT_4               0x87B1
#define PWRT_16              0x87B2
#define PWRT_64              0x87B3

#define BORV45               0x8783
#define BORV42               0x8793
#define BORV27               0x87A3
#define BORV20               0x87B3

#define PBOR_OFF             0x8733
#define PBOR_ON              0x87B3

#define PWMxL_ACT_LO         0x86B3
#define PWMxL_ACT_HI         0x87B3

#define PWMxH_ACT_LO         0x85B3
#define PWMxH_ACT_HI         0x87B3

#define RST_PWMPIN           0x83B3
#define RST_IOPIN            0x87B3

#define MCLR_DIS             0x07B3
#define MCLR_EN              0x87B3

/* Register FBS (0xf80006)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FBS;
#define _FBS(x) __attribute__((address(0xf80006),deprecated_definition("consider migrating to #pragma config"),section("__FBS.sec"),space(prog))) __prog__ uint16_t _FBS = (x);

/*
** Only one invocation of FBS should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBS.
** Multiple options may be combined, as shown:
**
** _FBS( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Boot Segment Program Memory Write Protect:
**     WR_PROTECT_BOOT_ON   Boot Segment Program Memory is write protected
**     WR_PROTECT_BOOT_OFF  Boot Segment Program Memory may be written
**
**   Boot Segment Program Flash Memory Code Protection:
**     HIGH_LARGE_BOOT_CODE High Security, Large-sized Boot Flash
**     HIGH_MEDIUM_BOOT_CODEHigh Security, Medium-sized Boot Flash
**     HIGH_SMALL_BOOT_CODE High Security, Small-sized Boot Flash
**     STRD_LARGE_BOOT_CODE Standard Security, Large-sized Boot Flash
**     STRD_MEDIUM_BOOT_CODEStandard Security, Medium-sized Boot Flash
**     STRD_SMALL_BOOT_CODE Standard Security, Small-sized Boot Flash
**     NO_BOOT_CODE         No Boot Segment
**
**   Boot Segment Data EEPROM Protection:
**     SMALL_BOOT_EEPROM    Boot EEPROM Enabled
**     NO_BOOT_EEPROM       No Boot EEPROM
**
**   Boot Segment Data RAM Protection:
**     LARGE_BOOT_RAM       Large-sized Boot RAM
**     MED_BOOT_RAM         Medium-sized Boot RAM
**     SMALL_BOOT_RAM       Small-sized Boot RAM
**     NO_BOOT_RAM          No Boot RAM
**
*/

