MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6010A/mcu.h
#define WR_PROTECT_BOOT_ON   0x310E
#define WR_PROTECT_BOOT_OFF  0x310F

#define HIGH_LARGE_BOOT_CODE 0x3101
#define HIGH_MEDIUM_BOOT_CODE 0x3103
#define HIGH_SMALL_BOOT_CODE 0x3105
#define STRD_LARGE_BOOT_CODE 0x3109
#define STRD_MEDIUM_BOOT_CODE 0x310B
#define STRD_SMALL_BOOT_CODE 0x310D
#define NO_BOOT_CODE         0x310F

#define SMALL_BOOT_EEPROM    0x300F
#define NO_BOOT_EEPROM       0x310F

#define LARGE_BOOT_RAM       0x010F
#define MED_BOOT_RAM         0x110F
#define SMALL_BOOT_RAM       0x210F
#define NO_BOOT_RAM          0x310F

/* Register FSS (0xf80008)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FSS;
#define _FSS(x) __attribute__((address(0xf80008),deprecated_definition("consider migrating to #pragma config"),section("__FSS.sec"),space(prog))) __prog__ uint16_t _FSS = (x);

/*
** Only one invocation of FSS should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FSS.
** Multiple options may be combined, as shown:
**
** _FSS( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Secure Segment Program Write Protect:
**     WR_PROT_SEC_ON       Enabled
**     WR_PROT_SEC_OFF      Disabled
**
**   Secure Segment Program Flash Memory Code Protection:
**     HIGH_LARGE_SEC_CODE  High Security, Large-sized Secure Flash
**     HIGH_MEDIUM_SEC_CODE High Security, Medium-sized Secure Flash
**     HIGH_SMALL_SEC_CODE  High Security, Small-sized Secure Flash
**     STRD_LAR_SEC_CODE    Standard Security, Large-sized Secure Flash
**     STRD_MED_SEC_CODE    Standard Security, Medium-sized Secure Flash
**     STRD_SMALL_SEC_CODE  Standard Security, Small-sized Secure Flash
**     NO_SEC_CODE          No Secure Segment
**
**   Secure Segment Data EEPROM Protection:
**     LAR_SEC_EEPROM       Large-sized Secure Data EEPROM
**     MED_SEC_EEPROM       Medium-sized Secure Data EEPROM
**     SMALL_SEC_EEPROM     Small-sized Secure Data EEPROM
**     NO_SEC_EEPROM        No Segment Data EEPROM
**
**   Secure Segment Data RAM Protection:
**     LARGE_SEC_RAM        Large-sized Secure RAM
**     MED_SEC_RAM          Medium-sized Secure RAM
**     SMALL_SEC_RAM        Small-sized Secure RAM
**     NO_SEC_RAM           No Secure RAM
**
*/

#define WR_PROT_SEC_ON       0x330E
#define WR_PROT_SEC_OFF      0x330F

#define HIGH_LARGE_SEC_CODE  0x3301
#define HIGH_MEDIUM_SEC_CODE 0x3303
#define HIGH_SMALL_SEC_CODE  0x3305
#define STRD_LAR_SEC_CODE    0x3309
#define STRD_MED_SEC_CODE    0x330B
#define STRD_SMALL_SEC_CODE  0x330D
#define NO_SEC_CODE          0x330F

#define LAR_SEC_EEPROM       0x300F
#define MED_SEC_EEPROM       0x310F
#define SMALL_SEC_EEPROM     0x320F
#define NO_SEC_EEPROM        0x330F

#define LARGE_SEC_RAM        0x030F
#define MED_SEC_RAM          0x130F
#define SMALL_SEC_RAM        0x230F
#define NO_SEC_RAM           0x330F

/* Register FGS (0xf8000a)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FGS;
#define _FGS(x) __attribute__((address(0xf8000a),deprecated_definition("consider migrating to #pragma config"),section("__FGS.sec"),space(prog))) __prog__ uint16_t _FGS = (x);

/*
** Only one invocation of FGS should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FGS.
** Multiple options may be combined, as shown:
**
** _FGS( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   General Code Segment Write Protect:
**     GWRP_ON              Enabled
**     GWRP_OFF             Disabled
**
**   General Segment Code Protection:
**     GSS_HIGH             High Security Code Protection Enabled
**     GSS_ON               Enabled
**     GSS_OFF              Disabled
**
*/

#define GWRP_ON              0x0006
#define GWRP_OFF             0x0007

#define GSS_HIGH             0x0003
#define GSS_ON               0x0005
#define GSS_OFF              0x0007

/* Register FICD (0xf8000c)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FICD;
#define _FICD(x) __attribute__((address(0xf8000c),deprecated_definition("consider migrating to #pragma config"),section("__FICD.sec"),space(prog))) __prog__ uint16_t _FICD = (x);

/*
** Only one invocation of FICD should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FICD.
** Multiple options may be combined, as shown:
**
** _FICD( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Comm Channel Select:
**     ICS_PGD3             Use EMUC3 and EMUD3
**     PGD3                 Use EMUC3 and EMUD3
**     ICS_PGD2             Use EMUC2 and EMUD2
**     PGD2                 Use EMUC2 and EMUD2
**     ICS_PGD1             Use EMUC1 and EMUD1
**     PGD1                 Use EMUC1 and EMUD1
**     ICS_PGD              Use PGC/EMUC and PGD/EMUD
**     PGD                  Use PGC/EMUC and PGD/EMUD
**
*/

#define ICS_PGD3             0xC000
#define PGD3                 0xC000
#define ICS_PGD2             0xC001
#define PGD2                 0xC001
#define ICS_PGD1             0xC002
#define PGD1                 0xC002
#define ICS_PGD              0xC003
#define PGD                  0xC003



/*
 * Memory Segments Sizes
 */

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0x7c

#define ___RESERVED_BASE 0x80
#define ___RESERVED_LENGTH 0x4

#define __AIVT_BASE 0x84
#define __AIVT_LENGTH 0x7c

#define __PROGRAM_BASE 0x100
#define __PROGRAM_LENGTH 0x17f00

#define __EEDATA_BASE 0x7ff000
#define __EEDATA_LENGTH 0x1000

#define __FUID0_BASE 0x8005c0
#define __FUID0_LENGTH 0x2

#define __FUID1_BASE 0x8005c2
#define __FUID1_LENGTH 0x2

#define __FUID2_BASE 0x8005c4
#define __FUID2_LENGTH 0x2

#define __FUID3_BASE 0x8005c6
#define __FUID3_LENGTH 0x2

#define __FOSC_BASE 0xf80000
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0xf80002
#define __FWDT_LENGTH 0x2

#define __FBORPOR_BASE 0xf80004
#define __FBORPOR_LENGTH 0x2

#define __FBS_BASE 0xf80006
#define __FBS_LENGTH 0x2

#define __FSS_BASE 0xf80008
#define __FSS_LENGTH 0x2

#define __FGS_BASE 0xf8000a
#define __FGS_LENGTH 0x2

#define __FICD_BASE 0xf8000c
#define __FICD_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x2000

#define __YDATA_BASE 0x1800
#define __YDATA_LENGTH 0x1800
#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x2000

#define __YDATA_BASE 0x1800
#define __YDATA_LENGTH 0x1800
#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x2000

#define __YDATA_BASE 0x1800
#define __YDATA_LENGTH 0x1800


#endif
